## `spring-blog`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform¥nmodule.spring-blog.data.aws_iam_policy_document.spring_blog_codepipeline_iam_role: Reading...
module.spring-blog.data.aws_iam_policy_document.spring_blog_codepipeline_iam_role: Read complete after 0s [id=382154967]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.spring-blog.aws_codepipeline.codepipeline will be created
  + resource "aws_codepipeline" "codepipeline" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "spring-blog-pipeline"
      + role_arn = (known after apply)
      + tags     = {
          + "Name" = "spring-blog-pipeline"
        }
      + tags_all = {
          + "Env"     = "dev"
          + "Name"    = "spring-blog-pipeline"
          + "Service" = "spring-blog"
        }

      + artifact_store {
          + location = "codepipeline-ap-northeast-2-586294528232"
          + region   = (known after apply)
          + type     = "S3"
        }

      + stage {
          + name = "Source"

          + action {
              + category         = "Source"
              + configuration    = (known after apply)
              + name             = "Source"
              + namespace        = "SourceVariables"
              + output_artifacts = [
                  + "SourceArtifact",
                ]
              + owner            = "AWS"
              + provider         = "CodeStarSourceConnection"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Deploy"

          + action {
              + category        = "Deploy"
              + configuration   = {
                  + "ApplicationName"     = "spring-blog"
                  + "DeploymentGroupName" = "spring-blog-deploy-group"
                }
              + input_artifacts = [
                  + "SourceArtifact",
                ]
              + name            = "Deploy"
              + namespace       = "DeployVariables"
              + owner           = "AWS"
              + provider        = "CodeDeploy"
              + region          = (known after apply)
              + run_order       = (known after apply)
              + version         = "1"
            }
        }
    }

  # module.spring-blog.aws_codestarconnections_connection.github will be created
  + resource "aws_codestarconnections_connection" "github" {
      + arn               = (known after apply)
      + connection_status = (known after apply)
      + id                = (known after apply)
      + name              = "hkpark130"
      + provider_type     = "GitHub"
      + tags_all          = {
          + "Env"     = "dev"
          + "Service" = "spring-blog"
        }
    }

  # module.spring-blog.aws_iam_role.spring_blog_codepipeline_role will be created
  + resource "aws_iam_role" "spring_blog_codepipeline_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codepipeline.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AWSCodePipelineServiceRole-ap-northeast-2-spring-blog-pipeline"
      + name_prefix           = (known after apply)
      + path                  = "/service-role/"
      + tags_all              = {
          + "Env"     = "dev"
          + "Service" = "spring-blog"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warnings:

- Value for undeclared variable

To see the full warning notes, run Terraform without -compact-warnings.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>